Autodesk.Revit.DB.Visual.AssetPropertyList.InsertNewAssetAsColor(Autodesk.Revit.DB.Color,System.Int32)
Insert a new AssetPropertyDouble4 containing the input value to this list.
value:
The color value to insert.
index:
An integer index.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.AddNewAssetAsColor(Autodesk.Revit.DB.Color)
Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color.
value:
The color value to add.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.IsValidValue(System.Collections.Generic.IList{Autodesk.Revit.DB.Visual.AssetProperty})
Check that value is valid.
value:
The array of properties to validate.
Returns:
Returns true if the array of properties is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetPropertyList.SetValue(System.Collections.Generic.IList{Autodesk.Revit.DB.Visual.AssetProperty})
Sets collection of properties stored in this property list.
Remarks:
All the properties in the list are of the same AssetPropertyType.
The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.
value:
An array of properties.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value is invalid for this AssetPropertyList property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
Since:
2014